
## Plan Result

[CI link](https://github.com/higa-private/Azure/actions/runs/17967926565)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 2 to change, 2 to destroy.</code></pre>

* Update
  * azurerm_linux_virtual_machine.vm
  * azurerm_storage_account.storage_account
* Replace
  * azurerm_role_assignment.key_vault_officer
  * azurerm_role_assignment.key_vault_secret_writer


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_linux_virtual_machine.vm will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "vm" {
        id                                                     = "/subscriptions/e75d5866-17d3-41a1-8868-12059d82f357/resourceGroups/develop-rg/providers/Microsoft.Compute/virtualMachines/runner-vm"
        name                                                   = "runner-vm"
        tags                                                   = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # azurerm_role_assignment.key_vault_officer must be replaced
-/+ resource "azurerm_role_assignment" "key_vault_officer" {
      + condition_version                = (known after apply)
      ~ id                               = "/subscriptions/e75d5866-17d3-41a1-8868-12059d82f357/resourceGroups/develop-rg/providers/Microsoft.KeyVault/vaults/terraform20250909/providers/Microsoft.Authorization/roleAssignments/b318541c-9661-0fb5-9465-97de9fbbf566" -> (known after apply)
      ~ name                             = "b318541c-9661-0fb5-9465-97de9fbbf566" -> (known after apply)
      ~ principal_id                     = "099877dd-a3a7-4e34-96eb-38487acd7541" -> "453e8174-7812-46e0-b798-f15eade05902" # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/e75d5866-17d3-41a1-8868-12059d82f357/providers/Microsoft.Authorization/roleDefinitions/b86a8fe4-44ce-4948-aee5-eccb2c155cd7" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.key_vault_secret_writer must be replaced
-/+ resource "azurerm_role_assignment" "key_vault_secret_writer" {
      + condition_version                = (known after apply)
      ~ id                               = "/subscriptions/e75d5866-17d3-41a1-8868-12059d82f357/resourceGroups/develop-rg/providers/Microsoft.KeyVault/vaults/terraform20250909/providers/Microsoft.Authorization/roleAssignments/7c32a248-7fa4-c47a-bb0c-11885ebaa665" -> (known after apply)
      ~ name                             = "7c32a248-7fa4-c47a-bb0c-11885ebaa665" -> (known after apply)
      - principal_id                     = "6eb188d5-0a35-4520-95c3-48ca9f74037e" -> null # forces replacement
      ~ principal_type                   = "User" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/e75d5866-17d3-41a1-8868-12059d82f357/providers/Microsoft.Authorization/roleDefinitions/b86a8fe4-44ce-4948-aee5-eccb2c155cd7" -> "/providers/Microsoft.Authorization/roleDefinitions/b86a8fe4-44ce-4948-aee5-eccb2c155cd7" # forces replacement
      ~ role_definition_name             = "Key Vault Secrets Officer" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/e75d5866-17d3-41a1-8868-12059d82f357/resourceGroups/develop-rg/providers/Microsoft.Storage/storageAccounts/develop01"
        name                              = "develop01"
        tags                              = {}
        # (40 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"Terraform_Exec","PRNumber":2,"Program":"tfcmt","SHA1":"6cc08d54b1c2c73b0ce3c6a4dcbcfb4f173d50e6","Vars":{},"WorkflowName":"develop workflow test"} -->